In [2]:
pip install pandas

Collecting pandas
  Using cached pandas-2.3.3-cp312-cp312-win_amd64.whl.metadata (19 kB)
Collecting numpy>=1.26.0 (from pandas)
  Using cached numpy-2.3.5-cp312-cp312-win_amd64.whl.metadata (60 kB)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\longv\appdata\roaming\python\python312\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Using cached pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Using cached tzdata-2025.3-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\longv\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Using cached pandas-2.3.3-cp312-cp312-win_amd64.whl (11.0 MB)
Using cached numpy-2.3.5-cp312-cp312-win_amd64.whl (12.8 MB)
Using cached pytz-2025.2-py2.py3-none-any.whl (509 kB)
Using cached tzdata-2025.3-py2.py3-none-any.whl (348 kB)
Installing collected packages: pytz, tzdata, numpy, pandas
Successfully installed numpy-2.3.5 pandas-2.3.3 pytz-2025.2 tzdata-2025.3
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.0.1 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [3]:
import pandas as pd
from pathlib import Path

In [5]:
data_dir = Path("wikivitals")

In [6]:
df = pd.read_csv(data_dir / "adjacency.tsv", sep="\t")
df

            0     1  True
0           0    56  True
1           0    58  True
2           0   206  True
3           0   426  True
4           0   444  True
...       ...   ...   ...
824993  10010  4531  True
824994  10010  6307  True
824995  10010  7560  True
824996  10010  7681  True
824997  10010  8512  True

[824998 rows x 3 columns]

In [8]:
df1 = pd.read_csv(data_dir / "biadjacency.tsv", sep="\t")
df1

             0    969  1
0            0   1462  1
1            0   1645  1
2            0   2304  1
3            0   2485  3
4            0   2791  2
...        ...    ... ..
1363295  10010  33974  1
1363296  10010  35155  1
1363297  10010  35590  1
1363298  10010  36328  1
1363299  10010  37192  1

[1363300 rows x 3 columns]

In [9]:
df2 = pd.read_csv(data_dir / "labels_hierarchy.tsv", sep="\t")
df2

        930
0       930
1       534
2      1168
3       829
4       839
...     ...
10005  1170
10006   633
10007   637
10008  1170
10009   930

[10010 rows x 1 columns]

In [10]:
df3 = pd.read_csv(data_dir / "labels.tsv", sep="\t")
df3

       5
0      5
1      2
2      6
3      4
4      4
...   ..
10005  6
10006  3
10007  3
10008  6
10009  5

[10010 rows x 1 columns]

In [11]:
df4 = pd.read_csv(data_dir / "names_col.tsv", sep="\t")
df4

            Alexis
0            Cairo
1      subordinate
2         marching
3          bengali
4             Adal
...            ...
37839   grassroots
37840          Rim
37841       parody
37842    martyrdom
37843        Wyler

[37844 rows x 1 columns]

In [12]:
df5 = pd.read_csv(data_dir / "names_labels_hierarchy.tsv", sep="\t")
df5

                          Arts|||Architecture|||General
0             Arts|||Architecture|||Specific structures
1     Arts|||Architecture|||Specific structures|||Se...
2                          Arts|||Architecture|||Styles
3                     Arts|||Cultural venues|||Americas
4                         Arts|||Cultural venues|||Asia
...                                                 ...
1962       Technology|||Transportation|||Road transport
1963  Technology|||Transportation|||Road transport||...
1964  Technology|||Transportation|||Road transport||...
1965  Technology|||Transportation|||Road transport||...
1966  Technology|||Transportation|||Road transport||...

[1967 rows x 1 columns]

In [13]:
df5.columns = ["hierarchy"]
df5_split = df5["hierarchy"].str.split(r"\|\|\|", expand=True)
df5_split

,0,1,2,3,4,5,6
0,Arts,Architecture,Specific structures,None,None,None,None
1,Arts,Architecture,Specific structures,Seven Wonders of the Ancient World,None,None,None
2,Arts,Architecture,Styles,None,None,None,None
3,Arts,Cultural venues,Americas,None,None,None,None
4,Arts,Cultural venues,Asia,None,None,None,None
...,...,...,...,...,...,...,...
1962,Technology,Transportation,Road transport,None,None,None,None
1963,Technology,Transportation,Road transport,Bicycle,None,None,None
1964,Technology,Transportation,Road transport,Driving,None,None,None
1965,Technology,Transportation,Road transport,Road,None,None,None
1966,Technology,Transportation,Road transport,Road,Highway,None,None

In [14]:
df6 = pd.read_csv(data_dir / "names_labels.tsv", sep="\t")
df6

                             Arts
0  Biological and health sciences
1                   Everyday life
2                       Geography
3                         History
4                     Mathematics
5                          People
6         Philosophy and religion
7               Physical sciences
8     Society and social sciences
9                      Technology

In [15]:
df7 = pd.read_csv(data_dir / "names.tsv", sep="\t")
df7

                             0
0                            1
1                   100 metres
2              14th Dalai Lama
3      1556 Shaanxi earthquake
4       1755 Lisbon earthquake
...                        ...
10005                   Ānanda
10006                    İzmir
10007                     Łódź
10008                Śāriputra
10009                       −1

[10010 rows x 1 columns]